Repository: keygenqt/aurora-toolbox
Catalog: po/*.po
Languages: ru

source: Cancel
ru: Отмена

source: Settings
ru: Настройки

source: Restart for changes required.
ru: Для внесения изменений требуется перезапуск.

source: Restart
ru: Перезапуск

source: Language
ru: Язык

source: The default language selection in the application is taken from the environment settings. This setting allows you to enable your preferred language regardless of the environment settings.
ru: Выбор языка по умолчанию в приложении берется из настроек среды. Эта настройка позволяет вам включить предпочитаемый вами язык независимо от настроек среды.

source: Hint
ru: Подсказки

source: The Aurora CLI application has a command hint feature. If you don't need it, you can turn it off to make the application output easier to read.
ru: Приложение Aurora CLI имеет функцию подсказки команд. Если она вам не нужна, вы можете отключить ее, чтобы сделать вывод приложения более удобным для чтения.

source: Select
ru: Выбор

source: By default, the latest version of Platform SDK/Flutter SDK is selected, the first device from the configuration file. By activating this setting when calling the --select argument, the application will remember your choice and without it, information will be taken from the cache.
ru: По умолчанию выбирается последняя версия Platform SDK/Flutter SDK, первое устройство из файла конфигурации. Активируя этот параметр при вызове аргумента --select, приложение запомнит ваш выбор, а без него информация будет взята из кэша.

source: Verbose
ru: Подробно

source: The --verbose flag enables verbose output after the command is executed. This setting enables verbose output by default.
ru: Флаг --verbose включает подробный вывод после выполнения команды. Эта настройка включает подробный вывод по умолчанию.

source: Color scheme
ru: Цветовая схема

source: In some environments, automatic theme installation is not available, you can try to install the color scheme manually.
ru: В некоторых окружениях не доступна авто установка темы, вы можете попробовать установить цветовую схему вручную.

source: Loading...
ru: Ожидаем...

source: Error
ru: Ошибка

source: Vitaliy Zarubin
ru: Виталий Зарубин

source: Close
ru: Закрыть

source: Yes
ru: Да

source: Access
ru: Доступ

source: Root access to the system is required to perform the operation.
ru: Для выполнения операции необходим root-доступ к системе.

source: Password
ru: Пароль

source: Installed
ru: Установлено

source: PSDK versions that are already installed.
ru: Версии PSDK, которые уже установлены.

source: Available
ru: Доступно

source: PSDK versions that can be installed.
ru: Версии PSDK, которые можно установить.

source: Something went wrong.
ru: Что-то пошло не так.

source: Emulator
ru: Эмулятор

source: Open in terminal like User
ru: Открыть в терминале (user)

source: Open in terminal like Root
ru: Открыть в терминале (root)

source: Tools
ru: Инструменты

source: Interact with the emulator.
ru: Взаимодействуйте с эмулятором.

source: Install package
ru: Установить пакет

source: Uninstall package
ru: Удалить пакет

source: Run package
ru: Запустить пакет

source: Upload file
ru: Загрузить файл

source: Failed to connect to the emulator.
ru: Не удалось подключиться к эмулятору.

source: The emulator is not running.
ru: Эмулятор не запущен.

source: Start
ru: Запустить

source: Welcome to application Aurora Toolbox!
ru: Добро пожаловать в приложение Aurora Toolbox!

source: Connection...
ru: Подключение...

source: Update available!
ru: Доступно обновление!

source: Documentation
ru: Документация

source: Connection successful.
ru: Подключение успешно установлено.

source: Aurora CLI not found.
ru: Aurora CLI не найдено.

source: You can install the application.
ru: Вы можете установить приложение.

source: Install
ru: Установить

source: Application installation is required.
ru: Требуется установка приложения.

source: Device
ru: Устройство

source: Open in terminal
ru: Открыть в терминале

source: Interact with the device.
ru: Взаимодействуйте с устройством.

source: Failed to connect to the device.
ru: Не удалось подключиться к устройству.

source: List of available targets.
ru: Список доступных targets.

source: Interact with the Platform SDK.
ru: Взаимодействие с Platform SDK.

source: Re-sign the package
ru: Переподписать пакет

source: Add Sudoers
ru: Добавить Sudoers

source: Remove Sudoers
ru: Удалить Sudoers

source: Remove Platform SDK
ru: Удалить Platform SDK

source: Not found installed the Platform SDK.
ru: Не найден установленный Platform SDK.

source: Failed to retrieve data the Platform SDK.
ru: Не удалось получить данные Platform SDK.

source: Retry
ru: Повторить попытку

source: Platform SDK has been successfully removed!
ru: Platform SDK успешно удален!

source: To List
ru: К списку

source: Development tools
ru: Инструменты разработки

source: In this section you can manage available development tools for Aurora OS.
ru: В этом разделе вы можете управлять доступными инструментами разработки для ОС Aurora.

source: Aurora SDK
ru: Аврора SDK

source: A set of tools for assembling, developing, debugging and testing application software for Aurora OS, using the mb2 tool.
ru: Набор инструментов для сборки, разработки, отладки и тестирования прикладного ПО для ОС Аврора, использующий инструмент mb2.

source: A set of tools for developing, debugging and testing Aurora OS components intended for CI.
ru: Набор инструментов для разработки, отладки и тестирования компонентов ОС Аврора предназначенного для CI.

source: A framework for creating beautiful, natively compiled applications from a single code base with support for Aurora OS.
ru: Фреймворк для создания красивых, изначально скомпилированных, приложений на основе единой кодовой базы с поддержкой ОС Аврора.

source: A code editor that is optimal for creating Flutter applications for Aurora OS.
ru: Редактор кода, оптимальный для создания Flutter приложений под ОС Аврора.

source: Device Management
ru: Управление устройствами

source: In this section you can find devices added to your configuration file or their emulation in VirtualBox.
ru: Устройства, добавленные в ваш файл конфигурации и эмулятор в VirtualBox.

source: Aurora OS devices connected via the SSH interface specified in the application configuration file.
ru: Устройства ОС Аврора подключенные по SSH интерфейсу указанный в конфигурационном файле приложения.

source: Working with the Aurora OS emulator installed with the Aurora SDK.
ru: Работа с эмулятором ОС Аврора устанавливаемый вместе с Аврора SDK.

source: Connections are managed through the base CLI application configuration file. Configure it to use devices and other functionality.
ru: Управление осуществляется через файл конфигурации приложения CLI. Настройте его для использования устройств и других функций.

source: Configuration
ru: Конфигурация

source: About Toolbox
ru: О Toolbox

source: Menu
ru: Меню

source: Devices
ru: Устройства

source: Active
ru: Активные

source: Devices that are connected.
ru: Подключенные устройства.

source: Non active
ru: Не активные

source: Devices not connected.
ru: Устройства не подключены.

source: No devices found in configuration file.
ru: В файле конфигурации не найдено ни одного устройства.

source: Run Aurora SDK
ru: Запустить Aurora SDK

source: Interact with the Aurora SDK.
ru: Взаимодействуйте с Aurora SDK.

source: Not found installed the Aurora SDK.
ru: Не найден установленный Aurora SDK.

source: Offline installer
ru: Оффлайн установщик

source: Online installer
ru: Онлайн-установщик

source: The setup file (*.run) has been downloaded. Install Aurora SDK it and then reload the page.
ru: Файл установки (*.run) загружен. Установите Aurora SDK, а затем перезагрузите страницу.

source: Refresh
ru: Обновить

source: Flutter versions that are already installed.
ru: Версии Flutter, которые уже установлены.

source: Flutter versions that can be installed.
ru: Версии Flutter, которые можно установить.

source: Run VS Code
ru: Запустить VS Code

source: Extensions for working with Flutter
ru: Расширения для работы с Flutter

source: This VS Code extension adds support for effectively editing, refactoring, running, and reloading Flutter mobile apps. It depends on (and will automatically install) the Dart extension for support for the Dart programming language.
ru: Это расширение VS Code добавляет поддержку для эффективного редактирования, рефакторинга, запуска и перезагрузки мобильных приложений Flutter. Оно зависит от расширения Dart (и автоматически установит его) для поддержки языка программирования Dart.

source: Extensions for working with C++
ru: Расширения для работы с C++

source: The C/C++ extension adds language support for C/C++ to Visual Studio Code, including editing (IntelliSense) and debugging features.
ru: Расширение C/C++ добавляет поддержку языка C/C++ в Visual Studio Code, включая функции редактирования (IntelliSense) и отладки.

source: This extension provides support for CMake in Visual Studio Code.
ru: Это расширение обеспечивает поддержку CMake в Visual Studio Code.

source: This extension provides support for Meson in Visual Studio Code.
ru: Это расширение обеспечивает поддержку Meson в Visual Studio Code.

source: Other
ru: Еще

source: Other extensions that might be useful
ru: Другие расширения, которые могут быть полезны

source: A basic spell checker that works well with code and documents.
ru: Базовая проверка орфографии, которая хорошо работает с кодом и документами.

source: This extension highlight in red color trailing white spaces.
ru: Это расширение выделяется красным цветом с лишние пробелы.

source: Update settings
ru: Обновить настройки

source: Updating the configuration file for work. There are things that are not installed by default, this button will correct the situation: add a final line when saving files, enable Russian language if there is an extension.
ru: Обновление файла конфигурации для работы. Есть вещи, которые не установлены по умолчанию, эта кнопка исправит ситуацию: добавит финальную строку при сохранении файлов, включит русский язык, если есть расширение.

source: Not found installed the Aurora Vscode.
ru: Не найден установленный Aurora Vscode.

source: Interact with the Target.
ru: Взаимодействуйте с Target.

source: Remove package
ru: Удалить пакет

source: Clear snapshot
ru: Очистить snapshot

source: Error load settings.
ru: Ошибка загрузки настроек.

source: Exit
ru: Выход

source: Getting data...
ru: Получение данных...

source: Version:
ru: Версия:

source: Do you want install "{{version}}" PSDK?
ru: Вы хотите установить "{{version}}" PSDK?

source: Download...
ru: Скачиваем...

source: Install...
ru: Установка...

source: Launching the emulator...
ru: Запускаем эмулятор...

source: Uninstall
ru: Удалить

source: Specify the name of the package you want to uninstall.
ru: Укажите имя пакета, который вы хотите удалить.

source: The package has been uninstall successfully!
ru: Пакет успешно удален!

source: Failed to uninstall package, please provide a valid package name.
ru: Не удалось удалить пакет. Укажите допустимое имя пакета.

source: Specify the name of the package you want to run.
ru: Укажите имя пакета, который вы хотите запустить.

source: Failed to run package, please provide a valid package name.
ru: Не удалось запустить пакет. Укажите допустимое имя пакета.

source: RPM package
ru: Пакет RPM

source: Installing...
ru: Установка...

source: The package was installed successfully!
ru: Пакет успешно установлен!

source: Failed to install package. Please provide a valid package file.
ru: Не удалось установить пакет. Пожалуйста, предоставьте действительный файл пакета.

source: All Files
ru: Все файлы

source: The file has been successfully downloaded to the ~/Download directory!
ru: Файл успешно загружен в каталог ~/Download!

source: Error loading file, something went wrong.
ru: Ошибка загрузки файла, что-то пошло не так.

source: Remove
ru: Удалить

source: Do you want remove "{{version}}" PSDK?
ru: Хотите удалить "{{version}}" PSDK?

source: Remove...
ru: Удаление...

source: Sign RPM
ru: Подпись RPM

source: The package has been successfully signed.
ru: Пакет успешно подписан.

source: Auth: SSH key
ru: Авторизация: SSH-ключ

source: Auth: Password
ru: Авторизация: Пароль

source: Get latest version...
ru: Получить последнюю версию...

source: Download
ru: Скачать

source: Do you want download "{{version}}" Aurora SDK and run install?
ru: Хотите загрузить "{{version}}" Aurora SDK и запустить установку?

source: Do you want remove "{{version}}" Flutter SDK?
ru: Хотите удалить "{{version}}" Flutter SDK?

source: Do you want install "{{version}}" Flutter SDK?
ru: Хотите установить "{{version}}" Flutter SDK?

source: Preparation...
ru: Подготовка...

source: Update settings...
ru: Обновить настройки...

source: Error, something went wrong.
ru: Ошибка, что-то пошло не так.
